In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [5]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
df = titanic.loc[:, ['age','fare']]
df['ten'] = 10
df.head()

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [10]:
def add_10(n):
    return n + 10

def add_two_obj(a, b):
    return a + b

def add_three_obj(a, b, c):
    return a + b + c

### 1-1. 개별 원소에 함수 매핑

#### 시리즈 원소에 함수 매핑

In [7]:
df['age'].apply(add_10)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [15]:
df['age'].apply(add_two_obj, b=10)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [12]:
df['age'].apply(add_three_obj, b=10, c=20)

0      52.0
1      68.0
2      56.0
3      65.0
4      65.0
       ...
886    57.0
887    49.0
888     NaN
889    56.0
890    62.0
Name: age, Length: 891, dtype: float64

In [18]:
df['age'].apply(lambda x: add_10(x))

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

In [19]:
df['age'].apply(lambda x: x + 10)

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

#### 데이터프레임 원소에 함수 매핑

In [20]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [21]:
def add_10(n):
    return n + 10

In [23]:
df_map = df.applymap(add_10)
df_map.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### 1-2. 시리즈 객체에 함수 매핑

#### 각 column에 매핑

In [24]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [25]:
def missing_value(series):
    return series.isnull()

In [26]:
result = df.apply(missing_value, axis=0)
result.head()

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

---

In [27]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [28]:
def min_max(x):
    return x.max() - x.min()

In [29]:
result = df.apply(min_max, axis = 0)
result

age      79.5800
fare    512.3292
dtype: float64

#### 각 row에 매핑

In [3]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df['ten'] = 10
df.head()

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [4]:
def add_two_obj(a, b):
    return a + b

In [5]:
df['add'] = df.apply(lambda x: add_two_obj(x['age'],x['fare']), axis = 1)

In [6]:
df.head()

    age     fare  ten       add
0  22.0   7.2500   10   29.2500
1  38.0  71.2833   10  109.2833
2  26.0   7.9250   10   33.9250
3  35.0  53.1000   10   88.1000
4  35.0   8.0500   10   43.0500

### 1-3. Dataframe 객채에 함수 mapping

In [8]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [38]:
# 각 column의 NaN찾기 - dataframe 반환
def missing_value(x):
    return x.isnull()

# 각 column의 NaN개수 반환 - Series 반환
def missing_count(x):
    return missing_value(x).sum(axis=0) # series

# 총 NaN 개수 반환 - Scalar 반환
def total_number_missing(x): 
    return missing_count(x).sum()

#### return dataframe

In [39]:
result_df = df.pipe(missing_value)
result_df.head()

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

#### return series

In [40]:
result_series = df.pipe(missing_count)
result_series.head()

age     177
fare      0
dtype: int64

#### return scalar

In [34]:
result_value = df.pipe(total_number_missing)
result_value

177